snlkuharlocal/src/DataProcessors/ОстаткиФилиалаШина/ОстаткиФилиалаШина.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ОстаткиФилиалаШина</name>
</mdclass:DataProcessor>

snlkuharlocal/src/AccumulationRegisters/ОстаткиТМЦ/ОстаткиТМЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиТМЦ</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийОстатки</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>CatalogRef.СтатьиЗатрат</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Оборот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДК</name>
    <type>
      <types>CatalogRef.ДисконтныеКарты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктДоставки</name>
    <type>
      <types>CatalogRef.ПунктыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ОборотБезСкидки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОборотУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОборотБезСкидкиУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Амортизация</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Акция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/AccumulationRegisters/РезервыТМЦ/РезервыТМЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РезервыТМЦ</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>DocumentRef.Заказ</types>
      <types>DocumentRef.ПредварительныйЗаказКлиента</types>
      <types>DocumentRef.ПродажаИМ</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.ВиртуальныйРезерв</types>
      <types>DocumentRef.ЗаявкаНаПерепаковку</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/Enums/ВыгружатьНаСайт/ВыгружатьНаСайт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВыгружатьНаСайт</name>
  <enumValues>
    <name>Да</name>
  </enumValues>
  <enumValues>
    <name>Нет</name>
  </enumValues>
  <enumValues>
    <name>КогдаКак</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ЖизненныйЦиклНоменклатуры/ЖизненныйЦиклНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЖизненныйЦиклНоменклатуры</name>
  <enumValues>
    <name>Активна</name>
  </enumValues>
  <enumValues>
    <name>Закрыта</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ВидыНоменклаутры/ВидыНоменклаутры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыНоменклаутры</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>ОсновноеСредство</name>
  </enumValues>
  <enumValues>
    <name>МБП</name>
  </enumValues>
  <enumValues>
    <name>Материал</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>ПодарочныйСертификат</name>
  </enumValues>
  <enumValues>
    <name>КомпьютернаяТехника</name>
  </enumValues>
  <enumValues>
    <name>РекламаПлатная</name>
  </enumValues>
  <enumValues>
    <name>РекламаБесплатная</name>
  </enumValues>
  <enumValues>
    <name>Упаковка</name>
  </enumValues>
  <enumValues>
    <name>ТМЦнаОтветственномХранении</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ТипыШтрихКодов/ТипыШтрихКодов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыШтрихКодов</name>
  <enumValues>
    <name>Штука</name>
    <comment>Штрих код штуки</comment>
  </enumValues>
  <enumValues>
    <name>Блочок</name>
    <comment>Штрих код блочка</comment>
  </enumValues>
  <enumValues>
    <name>Коробка</name>
    <comment>Штрих код коробки</comment>
  </enumValues>
  <enumValues>
    <name>Палета</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ВидыШК/ВидыШК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыШК</name>
  <enumValues>
    <name>Основной</name>
  </enumValues>
  <enumValues>
    <name>Дополнительный</name>
  </enumValues>
  <enumValues>
    <name>Временный</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Catalogs/ШтрихКоды/ШтрихКоды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШтрихКоды</name>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>ТипШК</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидШК</name>
    <type>
      <types>EnumRef.ВидыШК</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаМодификации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаМодификации</name>
    <type>
      <types>EnumRef.ПричиныКорректировкиШК</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтВКоробе</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФорматШК</name>
    <type>
      <types>EnumRef.ФорматыШК</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоКодGS1</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

snlkuharlocal/src/DataProcessors/ОстаткиФилиалаШина/ObjectModule.bsl
/////////////// СЛУЖЕБНЫЕ ///////////////////////////////////////////////////////////////

Функция ПрочитатьHTMLИзФайла(Файл)
	
	ЧтениеHTML = Новый ЧтениеHTML;
	ЧтениеHTML.ОткрытьФайл(Файл, "UTF-8");
	
	ПостроительDOM = Новый ПостроительDOM;
	ДокументHTML = ПостроительDOM.Прочитать(ЧтениеHTML);
	ЧтениеHTML.Закрыть();
	
	Возврат ПолучитьТекстHTML(ДокументHTML);
	
КонецФункции

Функция ПолучитьТекстHTML(ДокументHTML)
	
	ЗапиcьHTML = Новый ЗаписьHTML;
	ЗапиcьHTML.УстановитьСтроку();
	ЗаписьDOM = Новый ЗаписьDOM;
	ЗаписьDOM.Записать(ДокументHTML, ЗапиcьHTML);
	
	Возврат ЗапиcьHTML.Закрыть();
	
КонецФункции

/////////////////////////////////////////////////////////////////////////////////////////

Процедура Сформировать(ТаблицаПараметров = Неопределено) Экспорт
	СформироватьОтчет(ТаблицаПараметров);
КонецПроцедуры

Процедура СформироватьОтчет(ТаблицаПараметров)
	// Кухарь А.Ю.  31.05.2022 начало
	//
	ФизСкл=новый Массив; 
	СписокПолучателей=новый СписокЗначений;
	СтрокаПараметров="";
	// Кухарь А.Ю.  31.05.2022 конец
	
	Если ТаблицаПараметров <> Неопределено Тогда
		Для Каждого СтрокаТП ИЗ ТаблицаПараметров Цикл
			
			// Кухарь А.Ю.  31.05.2022 начало
			//Для записи в лог
			СтрокаПараметров=СтрокаПараметров+", Параметр: "+СтрокаТП.Имя+" - "+СтрокаТП.Значение; 
			// Кухарь А.Ю.  31.05.2022 конец
			
			
			Если СтрокаТП.Имя = "Склад" Тогда			
				// Кухарь А.Ю.  31.05.2022 начало
				ФизСкл.Добавить(СтрокаТП.Значение);
				// Кухарь А.Ю.  31.05.2022 конец
			КонецЕсли;
			
			
			// Кухарь А.Ю.  31.05.2022 начало
			//
			Если СтрокаТП.Имя = "Получатель" Тогда			
				// Кухарь А.Ю.  31.05.2022 начало
				СписокПолучателей.Добавить(СтрокаТП.Значение);
				// Кухарь А.Ю.  31.05.2022 конец
			КонецЕсли;
			
			// Кухарь А.Ю.  31.05.2022 конец
			
		КонецЦикла;
	КонецЕсли;
	//СписокПолучателей.Добавить("nechaeva@collant.ru");
	// Кухарь А.Ю.  31.05.2022 начало
	//
	ЗаписатьВЛог("Регламент",СтрокаПараметров,"Информация");
	
	если ФизСкл.Количество()=0  тогда 
		ЗаписатьВЛог("Регламент","Не выбрали склады","Информация");
		
		Возврат;
	КонецЕсли;
	
	если СписокПолучателей.Количество()=0 тогда
		ЗаписатьВЛог("Регламент","Не выбрали получателей","Информация");	
		Возврат;
	КонецЕсли;
	// Кухарь А.Ю.  31.05.2022 конец
	
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("Отчет");
	

		Запрос=Новый Запрос;     
	    Запрос.текст =   "ВЫБРАТЬ
	                     |	Ном.Ссылка КАК Номенклатура,
	                     |	СУММА(ВложенныйЗапрос.КолКонФакт) КАК КолКонФакт,
	                     |	СУММА(ВложенныйЗапрос.КолКонБух) КАК КолКонБух,
	                     |	СУММА(ВложенныйЗапрос.Резерв) КАК Резерв,
	                     |	ВложенныйЗапрос.НоменклатураСсылка.Родитель.Код КАК МодельКод,
	                     |	Ном.Код КАК Код,
	                     |	Ном.Наименование КАК Наименование,
	                     |	ВложенныйЗапрос1.ШК КАК Штрихкод
	                     |ИЗ
	                     |	Справочник.Номенклатура КАК Ном
	                     |		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                     |			СУММА(Остатки.КоличествоКонечныйОстаток) КАК КолКонБух,
	                     |			ВЫБОР
	                     |				КОГДА СУММА(Остатки.КоличествоКонечныйОстаток) = 0
	                     |					ТОГДА NULL
	                     |				ИНАЧЕ СУММА(Остатки.СуммаКонечныйОстаток) / СУММА(Остатки.КоличествоКонечныйОстаток)
	                     |			КОНЕЦ КАК ЦенаСеб,
	                     |			СУММА(Остатки.КоличествоКонечныйОстаток - ЕСТЬNULL(Резервы.КоличествоКонечныйОстаток, 0)) КАК КолКонФакт,
	                     |			СУММА(ЕСТЬNULL(Резервы.КоличествоКонечныйОстаток, 0)) КАК Резерв,
	                     |			Остатки.Номенклатура.Ссылка КАК НоменклатураСсылка,
	                     |			Остатки.Склад КАК Склад
	                     |		ИЗ
	                     |			РегистрНакопления.ОстаткиТМЦ.ОстаткиИОбороты(&Дата1, &Дата2, Период, , Склад В ИЕРАРХИИ (&Склады)) КАК Остатки
	                     |				ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.ОстаткиИОбороты(&дата1, &дата2, Период, , Склад В ИЕРАРХИИ (&Склады)) КАК Резервы
	                     |				ПО Остатки.Номенклатура = Резервы.Номенклатура
	                     |					И Остатки.Склад = Резервы.Склад
	                     |		
	                     |		СГРУППИРОВАТЬ ПО
	                     |			Остатки.Номенклатура.Ссылка,
	                     |			Остатки.Склад) КАК ВложенныйЗапрос
	                     |		ПО Ном.Ссылка = ВложенныйЗапрос.НоменклатураСсылка
	                     |		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                     |			Номенклатура.Код КАК Код,
	                     |			Номенклатура.Наименование КАК Наименование,
	                     |			ШтрихКоды.Наименование КАК ШК,
	                     |			Номенклатура.Цвет КАК Цвет,
	                     |			Номенклатура.Размер КАК Размер,
	                     |			Номенклатура.Родитель.Код КАК РодительКод,
	                     |			Номенклатура.Ссылка КАК Ссылка,
	                     |			ШтрихКоды.Ссылка КАК ШКСсылка
	                     |		ИЗ
	                     |			Справочник.Номенклатура КАК Номенклатура
	                     |				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтрихКоды КАК ШтрихКоды
	                     |				ПО Номенклатура.Ссылка = ШтрихКоды.Владелец
	                     |		ГДЕ
	                     |			Номенклатура.ПометкаУдаления = ЛОЖЬ
	                     |			И ШтрихКоды.ПометкаУдаления = ЛОЖЬ
	                     |			И ШтрихКоды.ТипШК = &ТипШК
	                     |			И ШтрихКоды.ВидШК = &ВидШК) КАК ВложенныйЗапрос1
	                     |		ПО Ном.Ссылка = ВложенныйЗапрос1.Ссылка
	                     |ГДЕ
	                     |	НЕ Ном.ЭтоГруппа
	                     |	И ВЫБОР
	                     |			КОГДА Ном.Ссылка.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	                     |				ТОГДА ""Да""
	                     |			КОГДА Ном.Ссылка.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	                     |				ТОГДА ""Нет""
	                     |			ИНАЧЕ ВЫБОР
	                     |					КОГДА Ном.Ссылка.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	                     |						ТОГДА ""Да""
	                     |					КОГДА Ном.Ссылка.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	                     |						ТОГДА ""Нет""
	                     |					ИНАЧЕ ВЫБОР
	                     |							КОГДА Ном.Ссылка.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	                     |								ТОГДА ""Да""
	                     |							КОГДА Ном.Ссылка.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	                     |								ТОГДА ""Нет""
	                     |							ИНАЧЕ ВЫБОР
	                     |									КОГДА Ном.Ссылка.Родитель.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	                     |										ТОГДА ""Да""
	                     |									КОГДА Ном.Ссылка.Родитель.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	                     |										ТОГДА ""Нет""
	                     |									ИНАЧЕ ""Нет""
	                     |								КОНЕЦ
	                     |						КОНЕЦ
	                     |				КОНЕЦ
	                     |		КОНЕЦ = ""Да""
	                     |	И Ном.ЖизненныйЦиклНоменклатуры = &активна
	                     |	И ВложенныйЗапрос.КолКонФакт > 0
	                     |	И Ном.Родитель.ВидНоменклатуры = &ТипТовар
	                     |
	                     |СГРУППИРОВАТЬ ПО
	                     |	Ном.Ссылка,
	                     |	ВложенныйЗапрос.НоменклатураСсылка.Родитель.Код,
	                     |	Ном.Код,
	                     |	Ном.Наименование,
	                     |	ВложенныйЗапрос1.ШК
	                     |
	                     |УПОРЯДОЧИТЬ ПО
	                     |	Ном.Наименование";
		
	Запрос.УстановитьПараметр("бюсты",Справочники.ТипыТоваровДляСайта.НайтиПоКоду("000000026"));
	Запрос.УстановитьПараметр("купальн",Справочники.ТипыТоваровДляСайта.НайтиПоКоду("000000011"));
	
	Склады = новый Массив;
	Склады.Добавить(справочники.Склады.НайтиПоКоду("STC-60"));
	Склады.Добавить(справочники.Склады.НайтиПоКоду("STA-48"));
	
	Запрос.УстановитьПараметр("склады", ФизСкл);
	//Запрос.УстановитьПараметр("ТекНом",СпРаспродажногоТОвара);
	Запрос.УстановитьПараметр("Дата2",НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Дата1",НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("активна",перечисления.ЖизненныйЦиклНоменклатуры.Активна);
	Запрос.УстановитьПараметр("ТипТовар", перечисления.ВидыНоменклаутры.Товар);
	Запрос.УстановитьПараметр("ТипШК", перечисления.ТипыШтрихКодов.Штука);
	Запрос.УстановитьПараметр("ВидШк", перечисления.ВидыШК.Основной);

	
	//Рез=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Группа");
	Рез=Запрос.Выполнить().Выбрать();
	//#Если Клиент Тогда
	//	Сообщить(" Количество выгружаемого товара - "+Рез.Количество());	
	//#КонецЕсли
	
	Результат = Запрос.Выполнить().Выбрать();
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Шапка");
	ОбластьНоменклатура = Макет.ПолучитьОбласть("Номенклатура");
	
	ТабДок.Очистить();
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.НачатьАвтогруппировкуСтрок();
	//
	ДругойЦвет=ложь;
	СтарыйСклад=Неопределено;
	СтараяНоменклатура=Неопределено;
	
	Пока Результат.Следующий() Цикл
		
		НоваяНоменклатура=Результат.Номенклатура;
		ОбластьНоменклатура.Параметры.Заполнить(Результат);
		ТабДок.Вывести(ОбластьНоменклатура);
		
	КонецЦикла;
	
	ТабДок.ЗакончитьАвтогруппировкуСтрок();
		
	ИмяФайла = КаталогВременныхФайлов() + "ОстаткиФилиала.XLS";
	ТабДок.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.XLS);
	
	ТекстСообщения = "Остатки филиала на дату "+ТекущаяДата();
	Осн =  документы.ЗаявкаНаДоставку.ПустаяСсылка();

	СформироватьВнутреннееУведомление(СписокПолучателей,ТекстСообщения, "Остатки филиала", Осн, , ИмяФайла);
	
	ЗаписатьВЛог("Регламент","Завершение выполнения.","Информация");
	//
	Параметры=новый ТаблицаЗначений;
	Параметры.Колонки.Добавить("Имя");
	Параметры.Колонки.Добавить("Значение");
	СтрТЗ=Параметры.Добавить();
	СтрТЗ.Имя="Обработка";
	СтрТЗ.Значение="ОбработатьПисьмаНаОтправку";
	//
	//
	//СтрТЗ=Параметры.Добавить();
	//СтрТЗ.Имя="ОтборПоДокументу";
	//СтрТЗ.Значение=Осн;
	
	МассивПараметров=новый Массив;
	МассивПараметров.Добавить(Параметры);
	ФоновыеЗадания.Выполнить("Регламент.ВнешнееЗадание",МассивПараметров,новый УникальныйИдентификатор,"Отправка писем для шины данных");
 
	
КонецПроцедуры
